In [1]:
import pandas as pd

## Visualización de los datos
- Mostrar los 3 conjuntos de datos para entender su relación
- Las tablas test y train, están relacionadas con la tabla gender_submission por la columna PassengerID

In [2]:
# Rutas relativas a los distintos dataset
gender_submision_path = 'data/gender_submission.csv'
test_path = 'data/test.csv'
train_path = 'data/train.csv'

In [3]:
# Mostramos el dataset gender_submision
gs = pd.read_csv(gender_submision_path)
# Mostramos las 3 primeras y últimas filas
pd.concat([gs.head(3), gs.tail(3)])

     PassengerId  Survived
0            892         0
1            893         1
2            894         0
415         1307         0
416         1308         0
417         1309         0

In [4]:
# Mostramos el dataset test
test = pd.read_csv(test_path)
# Mostramos las 3 primeras y últimas filas
pd.concat([test.head(3), test.tail(3)])

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [5]:
# Mostramos el dataset train
train = pd.read_csv(train_path)
# Mostramos las 3 primeras y últimas filas
pd.concat([train.head(3), train.tail(3)])

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

## Data wrangling

In [6]:
# Comprobamos la longitud de los 3 dataset
len(gs), len(test), len(train)

(418, 418, 891)

Tras analizar los datos de nuevo, podemos llegar a la conclusión de que combinando las tablas 'gs' y 'test', podemos extender el dataframe 'train' y crear un único dataframe que combina la información de los 3 archivos csv.

In [7]:
# Usamos el método merge de pandas, para unir a través de las columnas en común ambos conjuntos
gs_test = pd.merge(gs, test, left_on='PassengerId', right_on='PassengerId', how='left')
gs_test.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [8]:
# Vamos a unir ambos dataframes en un único dataframe que contenga toda la información
# acerca de los pasajeros del Titanic, lo llamaremos 'df' por simplificar la sintaxsix
df = train.append(gs_test, ignore_index=True, sort=False)

# Mostramos las 3 primeras y últimas filas
pd.concat([df.head(3), df.tail(3)])

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
1306,1307,0,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
1307,1308,0,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
1308,1309,0,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

## ¿Cuántas personas iban en el Titanic?

In [9]:
# Comprobamos si hay duplicados en la columna 'Name'
df[df['Name'].duplicated()]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
891,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
897,898,1,3,"Connolly, Miss. Kate",female,30.0,0,0,330972,7.6292,NaN,Q

In [10]:
# Hay dos nombres que se repiten, vamos a guardar estos nombres
duplicated_names = df[df['Name'].duplicated()]['Name']
# Mostramos los registros con nombres repetidos
df[df['Name'].isin(duplicated_names)]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
289,290,1,3,"Connolly, Miss. Kate",female,22.0,0,0,370373,7.7500,NaN,Q
696,697,0,3,"Kelly, Mr. James",male,44.0,0,0,363592,8.0500,NaN,S
891,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
897,898,1,3,"Connolly, Miss. Kate",female,30.0,0,0,330972,7.6292,NaN,Q

Los pasajeros con el mismo nombre no tienen la misma edad, ni el mismo ticket, con lo que podemos deducir que esta coincidencia es mera casualidad.

In [11]:
# Calculamos la longitud del dataframe
total_passengers = len(df)
print(f'El número total de pasajeros en el Titanic es de {total_passengers}')

El número total de pasajeros en el Titanic es de 1309

## ¿Cuántos hombres y mujeres sobrevivieron?

In [12]:
# Evaluamos las condiciones
is_male = df['Sex'] == 'male'
is_female = df['Sex'] == 'female'
survived = df['Survived'] == 1

# Calculamos la longitud de los subconjuntos aplicando los filtros anterirores
survivors_men = len(df[is_male & survived])
survivors_women = len( df[is_female & survived])

print(f'Sobrevivieron {survivors_men} hombres')
print(f'Sobrevivieron {survivors_women} mujeres')

Sobrevivieron 109 hombres
Sobrevivieron 385 mujeres

## ¿Cuál fue el top 10 de edad que más sobrevieron y el top 10 de edad que no lo lograron?

## ¿Cuántos cargos o títulos iban en el barco? Ejemplo: Capitanes, Mrs. Miss, etc. (pista: usa expresiones regulares)

## ¿Cuánto es la sumatoria del valor de los tickets en EUR? (pista: los tickets se vendieron en libras esterlinas)